{
    "0": "Changing the government is the only way to fix this. \nRight now, harper has the numbers to ram anything through Parliament.", 
    "1": "@Freedom Everyone has good arguments such as yourself . Why no opportunity, nor time to debate these serious issues? That's what Canadian's are asking for.", 
    "2": "I was born in Louisiana, and lived in 6 different Deep South US states; my last 15 years, before leaving the US, were spent in Alabama. I was reared on good old-fashioned conservative christianism. I took it to heart. \nAnd it was with utter astonishment that I realized most of the men who taught me, and for whom I had the utmost respect, from scoutmasters to deacons, were motivated by a force I will never let master me: Fear. \nFear of ... you name it ... terrorists, blacks, homosexuals, women...\n» more", 
    "3": "@Drydocked Canadian now see through the Liberals as they once saw through the Conservatives and will see through the Conservatives again. \nA pox on both your houses.", 
    "4": "Stop the harper madness.", 
    "5": "@White Man's Burden Round up the what? \nIs this what this board has devolved into? \nRacist comments are allowed to make it through moderation yet insightful posts aren't? \nThat has to be the most offensive thing i've seen posted on here in a while. \nYou and your right of center types would be better served on a front line without a weapon in a desert somewhere", 
    "6": "if harper can change laws for the RICH then after the next election the new leader of Canada should have warrants for the arrest for 260+ conservative criminals that tried to destroy Canada by force. Start with the puppet-master harper", 
    "7": "@JUCS \nYou just described the reformers to a T. They will say/do anything to get elected. Like hiring trolls to post supportive messages in comments sections.", 
    "8": "Don't split the vote this fall. \nBe patient with the next government. \nIt will take time to undo the damage left by Harper.", 
    "9": "@Uncommon senses \nThe right is united, why can't the left? This is when the Liberals must unite with the NDP? You say we must not split the vote - well it's up to Trudeau and Mulcair to lead the way.", 
    "10": "It's our civic duty to stop Stephen Harper! if stephen harper continues he will plunge canada into George Orwell's 1984.", 
    "11": "@Ellen Anaya Lockheart \nYou mean with \"Soldiers in the streets! With Guns! We're not making this up!\" Sorry pal, but the \"Harper's hidden agenda\" is passe.", 
    "12": "This government has shown a reckless disregard for the law, privacy, women, people of color, the military, the economy, the environment, agriculture, the prison system, international relations, and many other aspects of Canadian society. They simply cannot be trusted with this level of invasive data collection.", 
    "13": "@Lord nibbler \ni dont get it..Conservative philosophy revolves around small government, and limits and controls on the state..so what do C51 (harpergov.) supporters want? An all encompassing government bill giving the police and spy agencies more powers to monitor Canadians and with no civilian oversight as it is currently structured? Really? \nWhatever it is, its not \"conservatism\", more like the opposite.", 
    "14": "the harper government could care less about what Canadians and experts have to say. we won't be heard until October.", 
    "15": "@Drydocked If Harper and the neo-cons keep acting like Putin, they will give the Liberals and majority and Harper and the neo-cons will be tried for treason.", 
    "16": "all i can say to harper and his puppet factory is don't even think of cheating this election because 20 million Canadians will be watching this time,cheaters !", 
    "17": "@allday2l that is funny really 20 million ,not even a majority of this country voted....get a grip harper is a snake.....", 
    "18": "We will win in the end. Keep commenting, talking to your friends, participate in demonstrations, etc., etc. This totalitarian regime has to go.", 
    "19": "@Uncommon senses The vote is split because of silly campaigns like 'ABC' and 'Heave Steve'. Conservative voters are unified in their views. Everyone else votes AGAINST the Conservatives, not for a specific candidate. I'm not opposed to voting for any party, but until the other parties have something worth voting for I will stick with what works for me."
}
