{
  "collection1": [
    {
      "property1": "Why are those of us who are responsible, productive and contributing citizens responsible for the housing of those who are not? \nThe ONLY type of shelter we should supply is ward-like accommodations with the minimal basics - sort of what is offered hospital patients (!). \nAfter all, no one subsidizes or pays for OUR homes! \nShelter is a right and we should, as mentioned, provide a basic minimum. Anything more is luxury and part of an overblown sense of entitlement."
    },
    {
      "property1": "@sportspro6969 What makes you think they don't work? It's easy to be working poor in Mtl."
    },
    {
      "property1": "While we do not support slum landlords, we also understand how \"tenants rights\" arbitration has discouraged investors from building reasonably priced rental accommodation. We know many that have invested in commercial, office, industrial real estate instead. Others invest in condos where, once they are sold, they have no obligations except those that relate to construction work which expires at a set date."
    },
    {
      "property1": "@hchalice \nTrue. Existing rental properties are often sold off at bargain prices, to opportunists who either do not have the money or desire to do the expensive repairs, updating and maintenance."
    },
    {
      "property1": "Shameful of Couilliard. \nA 4 year ballot is unacceptable."
    },
    {
      "property1": "@Steve Karmazenuk \nLook at what they've done in Moose Jaw. \nThere are now 0 homeless. \nThey gave them housing, and total of costs that have been associated with homeless persons has been reduced."
    },
    {
      "property1": "The problem is the gentrification of the city; condominiums are metastasizing like cancer in the metropolis, spreading into formerly low-rent districts, squeezing out residents to seek other affordable housing. Unfortunately, what's left over is the dregs, with negligent landlords. So long as realtors are allowed to keep putting up condo projects (that are little more than slapdash drywall apartments themselves) instead of affordable housing, we will continue to see an unstoppable decline in...\n» more"
    },
    {
      "property1": "@Fairmount So is this trickle-down theory or just voodoo economics at work here?"
    },
    {
      "property1": "Hows this: \nSend out health inspectors, if the place is not fit for habitation, the landlord must pay 100% of the moving costs and full rent for ever tenant to move into a new place until they can get their hovel up to code? \nPut the cost on the landlord and watch how quickly the rats are cleaned up."
    },
    {
      "property1": "@aki_no_kaze \nOne of the problems with enforcement is collection.What if absentee landlords simply refuse to pay. \nAlso, bureaucracy is expensive. It is like saying, let's catch all tax cheats, fine but checking everyone's tax return is simply not possible in a rapid time-frame even with computers. \nOr how about enforcement of traffic codes (which actually bring in a good stream of revenue) - if you truly could fine everyone you would destroy the economy because you would suck in too much...\n» more"
    },
    {
      "property1": "Here's a couple of stories that shows what happens when you bring social housing into an area or when social housing leaves an area: \nhttp://globalnews.ca/news/243057/background-torontos-regent-park/ \nhttp://www.chicagomag.com/Chicago-Magazine/The-312/April-2012/Did-the-Destruction-of-Chicagos-Public-Housing-Decrease-Violent-Crime-Or-Just-Move-It-Elsewhere/ \nAlso. If you want to know more what happens when you create social housing especially in regards to crime, then just look at this. Pay...\n» more"
    },
    {
      "property1": "@sportspro6969 \nWell, I hardly like to point out the obvious but you do know that LA is not Canada and Montréal is not Toronto. \nQuébec City has social housing and low crime - anyway correlation is not causation as your second article notes in its sub-headline."
    },
    {
      "property1": "It's really easy to cut your rent in half by moving 30 kilometers from Montreal. Fact."
    },
    {
      "property1": "@Skibble5150 You're right & it's not like our freeways are overflowing with commuters during rush hour. Should be a cinch to get to work."
    },
    {
      "property1": "The 53.6 million from 2012 was mostly spent before the Liberals came to power in Quebec and since this is an austerity government I can understand their reluctance to funnel anymore money into the AGRTQ which, as stated, \"is a not-for-profit organization that works with community groups( NOT the government)to help build affordable housing projects\". \nThat being said I do believe that all levels of government along with community groups like the AGRTQ should work together better to tackle the...\n» more"
    }
  ]
}